report/statistics.json
{
  "Step 1: Login" : {
    "transaction" : "Step 1: Login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 193.12000000000006,
    "medianResTime" : 159.0,
    "minResTime" : 142.0,
    "maxResTime" : 756.0,
    "pct1ResTime" : 211.79999999999995,
    "pct2ResTime" : 582.6499999999992,
    "pct3ResTime" : 756.0,
    "throughput" : 5.112474437627812,
    "receivedKBytesPerSec" : 3.371437244376278,
    "sentKBytesPerSec" : 1.1673816142638038
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.04666666666661,
    "medianResTime" : 24.0,
    "minResTime" : 11.0,
    "maxResTime" : 756.0,
    "pct1ResTime" : 170.9,
    "pct2ResTime" : 221.45,
    "pct3ResTime" : 722.8500000000006,
    "throughput" : 15.292078703231725,
    "receivedKBytesPerSec" : 10.860561729024367,
    "sentKBytesPerSec" : 4.935876809562647
  },
  "Step 4: Verify Member" : {
    "transaction" : "Step 4: Verify Member",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.240000000000006,
    "medianResTime" : 15.0,
    "minResTime" : 11.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 24.9,
    "pct2ResTime" : 30.449999999999996,
    "pct3ResTime" : 57.0,
    "throughput" : 5.70645971239443,
    "receivedKBytesPerSec" : 3.555949162577037,
    "sentKBytesPerSec" : 2.0254588350262495
  },
  "Step 3: Borrow Book" : {
    "transaction" : "Step 3: Borrow Book",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 41.77999999999998,
    "medianResTime" : 21.5,
    "minResTime" : 15.0,
    "maxResTime" : 222.0,
    "pct1ResTime" : 188.89999999999975,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 222.0,
    "throughput" : 5.572272372673576,
    "receivedKBytesPerSec" : 4.725439338849883,
    "sentKBytesPerSec" : 2.145542530368884
  }
}